---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.EventStatus.Succeeded
enum: Autodesk.Revit.DB.Events.EventStatus
source: html/b2db4f59-a798-a61b-9dd4-02dd6e9700f0.htm
---
# Autodesk.Revit.DB.Events.EventStatus.Succeeded

The action that triggered this event succeeded.